
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/5789193201)


<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * local_file.index_page
* Update
  * aws_lambda_function.lambda
  * aws_lambda_function.scan
  * aws_s3_bucket.images
  * aws_s3_bucket.website


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "user_registration_consulcam"
      ~ last_modified                  = "2023-07-26T16:54:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "tHJu2emgQ9kzNW7FPMmapRecDBkm5Mhe9ozq4quonUI=" -> "Alfc5+hIWkPKzz7W6FQbDTns5SJFRvX1qVA0IcYPzLQ="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "scan_user_consulcam"
      ~ last_modified                  = "2023-07-26T16:54:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "tHJu2emgQ9kzNW7FPMmapRecDBkm5Mhe9ozq4quonUI=" -> "Alfc5+hIWkPKzz7W6FQbDTns5SJFRvX1qVA0IcYPzLQ="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":138,"Program":"tfcmt","SHA1":"671199250f410c657881d0c3f35788e9559e063c","Vars":{},"WorkflowName":"Deploy cases"} -->